
n = int(input())
n = str(n)
print('Максимальная цифра равна',max(n))
print('Минимальная цифра равна',min(n))

#==============================================================
'''max и min
Дано натуральное число n, \, (n \ge 10)n,(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.

Формат входных данных 
На вход программе подается одно натуральное число.

Формат выходных данных
Программа должна вывести максимальную и минимальную цифры введенного числа (с поясняющей надписью).

Тестовые данные 🟢
Sample Input 1:

26670
Sample Output 1:

Максимальная цифра равна 7
Минимальная цифра равна 0
Sample Input 2:

8945
Sample Output 2:

Максимальная цифра равна 9
Минимальная цифра равна 4
Sample Input 3:

7645897791
Sample Output 3:

Максимальная цифра равна 9
Минимальная цифра равна 1
Напишите программу. Тестируется через stdin → stdout
Верно решил 82 741 учащийся
Из всех попыток 43% верных
 Здорово, всё верно.
Теперь вам доступен Форум решений , где вы можете сравнить свое решение с другими или спросить совета.
# put your python code here
n = int(input())
n = str(n)
print('Максимальная цифра равна',max(n))
print('Минимальная цифра равна',min(n))


# put your python code here
n = int(input())
n = str(n)
print('Максимальная цифра равна',max(n))
print('Минимальная цифра равна',min(n))

'''