# put your python code here
n = int(input())
while n % 7 == 0:
    print(n)
    n = int(input())

# ==========================================
'''Пока делимся
На вход программе подается последовательность целых чисел делящихся на 77, каждое число на отдельной строке. Концом последовательности является любое число не делящееся на 77. Напишите программу, которая выводит члены данной последовательности.

Формат входных данных
На вход программе подается последовательность чисел, каждое число на отдельной строке.

Формат выходных данных
Программа должна вывести члены данной последовательности.

Тестовые данные 🟢
Sample Input 1:

49
2401
4809
0
2
10
100
Sample Output 1:

49
2401
4809
0
Sample Input 2:

7
7
14
21
13
21
12
45
56
7
7
Sample Output 2:

7
7
14
21
Sample Input 3:

7
8
9
8
Sample Output 3:

7
Напишите программу. Тестируется через stdin → stdout
Верно решили 87 180 учащихся
Из всех попыток 66% верных
 Хорошие новости, верно!
Теперь вам доступен Форум решений , где вы можете сравнить свое решение с другими или спросить совета.
# put your python code here
n = int(input())
while n % 7 == 0:
    print(n)
    n = int(input())

1
# put your python code here
2
n = int(input())
3
while n % 7 == 0:
4
    print(n)
5
    n = int(input())
6
​
7
​
8
​
9
​
Test input:
7
8
9
8
Test output:
7'''
